; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p14---int100n150-m25---int100c150---s300---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level5 level5)
(sum level0 level13 level13)
(sum level0 level17 level17)
(sum level0 level19 level19)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level5 level6)
(sum level1 level13 level14)
(sum level1 level17 level18)
(sum level1 level19 level20)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level5 level7)
(sum level2 level13 level15)
(sum level2 level17 level19)
(sum level2 level19 level21)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level5 level8)
(sum level3 level13 level16)
(sum level3 level17 level20)
(sum level3 level19 level22)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level5 level9)
(sum level4 level13 level17)
(sum level4 level17 level21)
(sum level4 level19 level23)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level5 level10)
(sum level5 level13 level18)
(sum level5 level17 level22)
(sum level5 level19 level24)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level5 level11)
(sum level6 level13 level19)
(sum level6 level17 level23)
(sum level6 level19 level25)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level5 level12)
(sum level7 level13 level20)
(sum level7 level17 level24)
(sum level7 level19 level26)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level5 level13)
(sum level8 level13 level21)
(sum level8 level17 level25)
(sum level8 level19 level27)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level5 level14)
(sum level9 level13 level22)
(sum level9 level17 level26)
(sum level9 level19 level28)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level5 level15)
(sum level10 level13 level23)
(sum level10 level17 level27)
(sum level10 level19 level29)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level5 level16)
(sum level11 level13 level24)
(sum level11 level17 level28)
(sum level11 level19 level30)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level5 level17)
(sum level12 level13 level25)
(sum level12 level17 level29)
(sum level12 level19 level31)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level5 level18)
(sum level13 level13 level26)
(sum level13 level17 level30)
(sum level13 level19 level32)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level5 level19)
(sum level14 level13 level27)
(sum level14 level17 level31)
(sum level14 level19 level33)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level5 level20)
(sum level15 level13 level28)
(sum level15 level17 level32)
(sum level15 level19 level34)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level5 level21)
(sum level16 level13 level29)
(sum level16 level17 level33)
(sum level16 level19 level35)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level5 level22)
(sum level17 level13 level30)
(sum level17 level17 level34)
(sum level17 level19 level36)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level5 level23)
(sum level18 level13 level31)
(sum level18 level17 level35)
(sum level18 level19 level37)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level5 level24)
(sum level19 level13 level32)
(sum level19 level17 level36)
(sum level19 level19 level38)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level5 level25)
(sum level20 level13 level33)
(sum level20 level17 level37)
(sum level20 level19 level39)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level5 level26)
(sum level21 level13 level34)
(sum level21 level17 level38)
(sum level21 level19 level40)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level5 level27)
(sum level22 level13 level35)
(sum level22 level17 level39)
(sum level22 level19 level41)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level5 level28)
(sum level23 level13 level36)
(sum level23 level17 level40)
(sum level23 level19 level42)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level5 level29)
(sum level24 level13 level37)
(sum level24 level17 level41)
(sum level24 level19 level43)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level5 level30)
(sum level25 level13 level38)
(sum level25 level17 level42)
(sum level25 level19 level44)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level5 level31)
(sum level26 level13 level39)
(sum level26 level17 level43)
(sum level26 level19 level45)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level5 level32)
(sum level27 level13 level40)
(sum level27 level17 level44)
(sum level27 level19 level46)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level5 level33)
(sum level28 level13 level41)
(sum level28 level17 level45)
(sum level28 level19 level47)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level5 level34)
(sum level29 level13 level42)
(sum level29 level17 level46)
(sum level29 level19 level48)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level5 level35)
(sum level30 level13 level43)
(sum level30 level17 level47)
(sum level30 level19 level49)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level5 level36)
(sum level31 level13 level44)
(sum level31 level17 level48)
(sum level31 level19 level50)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level5 level37)
(sum level32 level13 level45)
(sum level32 level17 level49)
(sum level32 level19 level51)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level5 level38)
(sum level33 level13 level46)
(sum level33 level17 level50)
(sum level33 level19 level52)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level5 level39)
(sum level34 level13 level47)
(sum level34 level17 level51)
(sum level34 level19 level53)
(sum level35 level1 level36)
(sum level35 level5 level40)
(sum level35 level13 level48)
(sum level35 level17 level52)
(sum level35 level19 level54)
(sum level36 level1 level37)
(sum level36 level5 level41)
(sum level36 level13 level49)
(sum level36 level17 level53)
(sum level36 level19 level55)
(sum level37 level1 level38)
(sum level37 level5 level42)
(sum level37 level13 level50)
(sum level37 level17 level54)
(sum level37 level19 level56)
(sum level38 level1 level39)
(sum level38 level5 level43)
(sum level38 level13 level51)
(sum level38 level17 level55)
(sum level38 level19 level57)
(sum level39 level1 level40)
(sum level39 level5 level44)
(sum level39 level13 level52)
(sum level39 level17 level56)
(sum level40 level1 level41)
(sum level40 level5 level45)
(sum level40 level13 level53)
(sum level40 level17 level57)
(sum level41 level1 level42)
(sum level41 level5 level46)
(sum level41 level13 level54)
(sum level42 level1 level43)
(sum level42 level5 level47)
(sum level42 level13 level55)
(sum level43 level1 level44)
(sum level43 level5 level48)
(sum level43 level13 level56)
(sum level44 level1 level45)
(sum level44 level5 level49)
(sum level44 level13 level57)
(sum level45 level1 level46)
(sum level45 level5 level50)
(sum level46 level1 level47)
(sum level46 level5 level51)
(sum level47 level1 level48)
(sum level47 level5 level52)
(sum level48 level1 level49)
(sum level48 level5 level53)
(sum level49 level1 level50)
(sum level49 level5 level54)
(sum level50 level1 level51)
(sum level50 level5 level55)
(sum level51 level1 level52)
(sum level51 level5 level56)
(sum level52 level1 level53)
(sum level52 level5 level57)
(sum level53 level1 level54)
(sum level54 level1 level55)
(sum level55 level1 level56)
(sum level56 level1 level57)

(connected l0 l1)
(fuelcost level17 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l0 l3)
(fuelcost level5 l0 l3)
(connected l1 l0)
(fuelcost level17 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l1 l3)
(fuelcost level1 l1 l3)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)
(connected l2 l3)
(fuelcost level19 l2 l3)
(connected l3 l0)
(fuelcost level5 l3 l0)
(connected l3 l1)
(fuelcost level1 l3 l1)
(connected l3 l2)
(fuelcost level19 l3 l2)

(at t0 l1)
(fuel t0 level57)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l1)
(at p3 l2)
(at p4 l2)
(at p5 l3)
(at p6 l2)
(at p7 l1)
(at p8 l2)
(at p9 l1)
(at p10 l1)
(at p11 l2)
(at p12 l3)
(at p13 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l2)
(at p8 l0)
(at p9 l2)
(at p10 l2)
(at p11 l3)
(at p12 l0)
(at p13 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 14
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 14
3. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 14
4. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 14
5. (drive t0 l1 l3 level56 level1 level57)
   deleted: (at t0 l1) (fuel t0 level57)
   added: (at t0 l3) (fuel t0 level56)
   goals met: 0 of 14
6. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 14
7. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 0 of 14
8. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 14
9. (drive t0 l3 l0 level51 level5 level56)
   deleted: (at t0 l3) (fuel t0 level56)
   added: (at t0 l0) (fuel t0 level51)
   goals met: 0 of 14
10. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 14
11. (drive t0 l0 l2 level38 level13 level51)
   deleted: (at t0 l0) (fuel t0 level51)
   added: (at t0 l2) (fuel t0 level38)
   goals met: 0 of 14
12. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 14
13. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 2 of 14
14. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 3 of 14
15. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 4 of 14
16. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 5 of 14
17. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 5 of 14
18. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 5 of 14
19. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 5 of 14
20. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 5 of 14
21. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 5 of 14
22. (drive t0 l2 l0 level25 level13 level38)
   deleted: (at t0 l2) (fuel t0 level38)
   added: (at t0 l0) (fuel t0 level25)
   goals met: 5 of 14
23. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 5 of 14
24. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 6 of 14
25. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 7 of 14
26. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 8 of 14
27. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 9 of 14
28. (drive t0 l0 l1 level8 level17 level25)
   deleted: (at t0 l0) (fuel t0 level25)
   added: (at t0 l1) (fuel t0 level8)
   goals met: 9 of 14
29. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 10 of 14
30. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 11 of 14
31. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 12 of 14
32. (drive t0 l1 l3 level7 level1 level8)
   deleted: (at t0 l1) (fuel t0 level8)
   added: (at t0 l3) (fuel t0 level7)
   goals met: 12 of 14
33. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 13 of 14
34. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 14 of 14
